fonecmid-diplom/src/InformationRegisters/ВКМ_ЗаписиЗадач/ВКМ_ЗаписиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ЗаписиЗадач</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/InformationRegisters/ВКМ_ЗаписиЗадач/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	// Документ помечается на удаление
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПовторыЗадачи = ЭтотОбъект.Выгрузить(, "Период, ВремяНачала, ВремяОкончания");
	
	ТаблицаПериодов = ЭтотОбъект.Выгрузить(, "Период");
	ТаблицаПериодов.Свернуть("Период"); 
	
	Если 
		НаличиеПересеченийПовторовЗадачи(ТаблицаПериодов, ПовторыЗадачи) ИЛИ
		НаличиеПересеченийСДругимиЗадачами(ТаблицаПериодов, ПовторыЗадачи)
	Тогда
		Отказ = Истина;
	КонецЕсли;
		
КонецПроцедуры

Функция НаличиеПересеченийПовторовЗадачи(ТаблицаПериодов, ПовторыЗадачи)

	НаличиеПересечений = Ложь;
	
	Для каждого СтрокаТаблицыПериодов Из ТаблицаПериодов Цикл
		НаличиеПересеченийНаПериод = Ложь;
		ПовторыНаПериод = ПовторыЗадачи.НайтиСтроки(Новый Структура("Период", СтрокаТаблицыПериодов.Период));
		// Предпоследний индекс
		Для ТекущийИндекс = 0 По ПовторыНаПериод.ВГраница()- 1 Цикл
			// Последний индекс 
			Для СледующийИндекс = ТекущийИндекс + 1 По ПовторыНаПериод.ВГраница() Цикл
				
				СамоеПозднееНачало = Макс(ПовторыНаПериод[ТекущийИндекс].ВремяНачала, ПовторыНаПериод[СледующийИндекс].ВремяНачала);
				СамоеРанееОкончание = Мин(ПовторыНаПериод[ТекущийИндекс].ВремяОкончания, ПовторыНаПериод[СледующийИндекс].ВремяОкончания);
				// Новое событие начинается раньше, чем заканчивается старое
				Если СамоеПозднееНачало < СамоеРанееОкончание Тогда
					НаличиеПересеченийНаПериод = Истина;
					// Передача управления на другой оператор программы
					Перейти ~ВыходИзДвойногоЦикла;
				КонецЕсли;	
				
			КонецЦикла;
		КонецЦикла;
		
		~ВыходИзДвойногоЦикла:
		ВыводСообщения(НаличиеПересеченийНаПериод, "с повторами задачи", СтрокаТаблицыПериодов.Период, НаличиеПересечений);
	КонецЦикла;
	Возврат НаличиеПересечений;
КонецФункции 

Функция НаличиеПересеченийСДругимиЗадачами(ТаблицаПериодов, ПовторыЗадачи)
	НаличиеПересечений = Ложь;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_ЗаписиЗадач.Период КАК Период,
		|	ВКМ_ЗаписиЗадач.ВремяНачала КАК ВремяНачала,
		|	ВКМ_ЗаписиЗадач.ВремяОкончания КАК ВремяОкончания
		|ИЗ
		|	РегистрСведений.ВКМ_ЗаписиЗадач КАК ВКМ_ЗаписиЗадач
		|ГДЕ
		|	ВКМ_ЗаписиЗадач.Пользователь = &Пользователь
		|	И ВКМ_ЗаписиЗадач.Период В(&ДатыПовторов)
		|	И ВКМ_ЗаписиЗадач.Регистратор <> &Регистратор
		|ИТОГИ ПО
		|	Период";
	
	Запрос.УстановитьПараметр("ДатыПовторов", ТаблицаПериодов.ВыгрузитьКолонку("Период"));
	Запрос.УстановитьПараметр("Пользователь",ЭтотОбъект[0].Пользователь);
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Отбор.Регистратор.Значение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаПериод = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаПериод.Следующий() Цикл 
		НаличиеПересеченийНаПериод = Ложь;
		ПовторыНаПериод = ПовторыЗадачи.НайтиСтроки(Новый Структура("Период", ВыборкаПериод.Период));
		
		ВыборкаПовтор = ВыборкаПериод.Выбрать();
		Пока ВыборкаПовтор.Следующий() Цикл
			Для каждого Повтор Из ПовторыНаПериод Цикл
				
				СамоеПозднееНачало = Макс(ВыборкаПовтор.ВремяНачала, Повтор.ВремяНачала);
				СамоеРаннееОкончание = Мин(ВыборкаПовтор.ВремяОкончания, Повтор.ВремяОкончания);
				
				Если СамоеПозднееНачало < СамоеРаннееОкончание Тогда
					НаличиеПересеченийНаПериод = Истина;
					Перейти ~ВыходИзВторогоДвойногоЦикла;
				КонецЕсли;
				
			КонецЦикла;
		КонецЦикла;
		
		~ВыходИзВторогоДвойногоЦикла:
		ВыводСообщения(НаличиеПересеченийНаПериод, "с другими задачами", ВыборкаПериод.Период, НаличиеПересечений);
	КонецЦикла;
	Возврат НаличиеПересечений;
	
КонецФункции 

Процедура ВыводСообщения(НаличиеПересеченийНаПериод, ТипПересечения, ПериодПересечения, НаличиеПересечений)
	Если НаличиеПересеченийНаПериод Тогда
		СтрокаСообщения = СтрШаблон("Пересечения %1 на %2", ТипПересечения, Формат(ПериодПересечения, "ДФ=dd.MM.yyyy"));
		Сообщить(СтрокаСообщения);
		НаличиеПересечений = Истина;
	КонецЕсли;
КонецПроцедуры
